#include <iostream>
#include <cstring>
#include <windows.h>
#include "Account.h"

using namespace std;

/*
==========================================================================================================================================
                                        ДОМАШНЄ ЗАВДАННЯ 23 тема: статичні члени, покажчик this.
==========================================================================================================================================

  Тема: банківський рахунок (клас Account).
  Завдання має 3 рівні. Рівень 1 обов'язковий для всіх, рівень 2 — бажаний, рівень 3 — бонус. Частина «ПОЯСНИ» обов'язкова для всіх.

  ВАЖЛИВЕ ОБМЕЖЕННЯ
  Об'єкти Account передавайте у функції та методи ЛИШЕ за посиланням (Account&). Не пишіть  Account b = a; 
  і не передавайте Account за значенням: програма впаде (пам'ятаєте приклад ShallowCopy із теми про строки в стилі С?). 
  * Чому так і як це виправити — тема наступного уроку.

  ---------------------------------------------------------------
  РІВЕНЬ 1. Клас Account (обов'язковий)
  ---------------------------------------------------------------

  Поля (private):
    - char* owner        — ім'я власника, динамічний рядок;
    - double balance     — баланс у гривнях;
    - const int id       — унікальний номер рахунку.

  Статичні поля (private):
    - int count          — скільки рахунків існує ЗАРАЗ;
    - int nextId         — номер для наступного рахунку, починається з 1001;
    - double totalMoney  — сума грошей на ВСІХ рахунках разом.
    *   Не забудьте визначити їх поза класом (чи зробити inline).

  Конструктори:
    - Account(const char* owner, double balance) — головний конструктор:
        * id отримує значення nextId, після чого nextId збільшується на 1 (у списку ініціалізації);
        * ім'я встановлюється через setOwner;
        * початковий баланс приймається, лише якщо він більший за 0, інакше баланс = 0;
        * збільшує count і додає баланс до totalMoney;
        * виводить повідомлення:  [+] Рахунок #1001 (Олена)
    - Account(const char* owner) — делегує головному з балансом 0;
    - Account() — делегує головному з ім'ям "Без імені" і балансом 0.

  Деструктор:
    - виводить повідомлення:  [-] Рахунок #1001 (Олена)
    - віднімає свій баланс від totalMoney, зменшує count;
    - звільняє пам'ять owner.

  Методи:
    - void setOwner(const char* owner) — як setName у Student. Параметр має ТЕ САМЕ ім'я, що й поле: використовуйте this->.
    - double getBalance(), int getId();
    - void deposit(double amount) — поповнення; сума має бути більшою за 0;
    - void withdraw(double amount) — зняття; сума більша за 0 і не більша за баланс, інакше вивести «Відмова: недостатньо коштів»;
    - void print() — виводить:  #1001 Олена: 1000 грн
    - static int getCount(), static double getTotalMoney().
    Увага: deposit і withdraw мають змінювати і balance, і totalMoney.

  main:
    1. До створення будь-якого рахунку виведіть Account::getCount().
    2. Створіть три рахунки, використавши всі три конструктори.
    3. Поповніть і зніміть гроші, спробуйте зняти більше, ніж є.
    4. Виведіть усі рахунки, getCount() і getTotalMoney().

  ---------------------------------------------------------------
  РІВЕНЬ 2. Ланцюжок викликів і переказ (бажаний)
  ---------------------------------------------------------------

  1. Змініть deposit і withdraw так, щоб вони повертали Account& (return *this;). У main виконайте одним рядком:
         a.deposit(500).withdraw(200).print();

  2. Додайте метод  bool transfer(Account& to, double amount):
     - переказ суми з поточного рахунку на рахунок to;
     - якщо to — це той самий рахунок if(this == &to), вивести «Відмова: переказ самому собі» і повернути false;
     - якщо сума не більша за 0 або більша за баланс — вивести «Відмова: некоректна сума» і повернути false;
     - інакше перевести гроші і повернути true. У main перевірте всі три випадки: успішний переказ, переказ самому собі, переказ завеликої суми.

  ---------------------------------------------------------------
  РІВЕНЬ 3. Масив рахунків (бонус)
  ---------------------------------------------------------------

  1. Створіть динамічний масив з n рахунків:  new Account[n]; (n введіть з клавіатури). Які конструктори викликались?
  2. Поповніть кілька рахунків масиву різними сумами.
  3. Знайдіть і виведіть рахунок з найбільшим балансом.
  4. Видаліть масив і переконайтеся, що getCount() і getTotalMoney() повернулися до значень, які були до створення масиву.

  ---------------------------------------------------------------
  ЧАСТИНА «ПОЯСНИ» (обов'язкова)
  ---------------------------------------------------------------

  Відповіді напишіть СВОЇМИ словами в коментарі в кінці файлу.

  1. Чому count і totalMoney статичні, а balance — ні?
  2. Навіщо в setOwner потрібен this->? Що станеться, якщо його прибрати?
  3. Чому getCount() можна викликати ще до створення будь-якого рахунку?
  4. (Рівень 2) Що станеться, якщо в transfer прибрати перевірку if(this == &to)? Чи зміниться totalMoney після переказу? Чому?
  5. (Рівень 2) Чому deposit повертає Account&, а не Account?
*/

// ===== Ваш код =====


int Account::count = 0;
int Account::nextId = 1001;
double Account::totalMoney = 0;

int main()
{
    SetConsoleOutputCP(65001);
    SetConsoleCP(65001);

    // РІВЕНЬ 1

    cout << Account::getCount() << endl;

    Account privatBank("Гриша", 1000);
    Account oshad("Миша");
    Account sense;

    oshad.deposit(3000);
    sense.deposit(4000);
    sense.withdraw(450);
    cout << endl << "Попытка снять больше, чем есть на счету: " << endl;
    privatBank.withdraw(2000);
    cout << endl;

    privatBank.print();
    oshad.print();
    sense.print();

    cout << "Количество пользователей: " << Account::getCount() << endl;
    cout << "Общий банк: " << Account::getTotalMoney() << endl;

    // РІВЕНЬ 2

    sense.deposit(500).withdraw(200).print();

    sense.transfer(sense, 450);
    privatBank.transfer(oshad, 2000);

    if (sense.transfer(privatBank, 2000))
        cout << "Операция успешно выполнена!" << endl;

    // РІВЕНЬ 3

    int size;
    cout << "Введите размер массива: ";
    cin >> size;
    Account* accounts = new Account[size];

    for (int i = 0; i < size; i++)
    {
        int amount;
        cout << "Введите сумму: ";
        cin >> amount;
        accounts[i].deposit(amount);
    }

    int bigger = 0;
    for (int i = 0; i < size; i++)
    {
        if (accounts[bigger].getBalance() < accounts[i].getBalance())
            bigger = i;
    }
    cout << "Счёт с наибольшим балансом: ";
    accounts[bigger].print();

    cout << "Количество пользователей: " << Account::getCount() << endl;
    cout << "Общий банк: " << Account::getTotalMoney() << endl;
    delete[] accounts;
    cout << "Количество пользователей после удаления массива: " << Account::getCount() << endl;
    cout << "Общий банк после удаления массива: " << Account::getTotalMoney() << endl;

    return 0;
}

/*
  ВІДПОВІДІ НА ЧАСТИНУ «ПОЯСНИ»

  1. Чому count і totalMoney статичні, а balance — ні?
  Потому что count и totalMoney -  это общие для всех экземпляров класса счётчики, а balance - у каждого экземпляра должен быть свой

  2. Навіщо в setOwner потрібен this->? Що станеться, якщо його прибрати?
  Потому что имена аргумента в методе и поля класса совпадают и компилятор не знает, к какой переменной обратиться. 
  Если убрать this-> то все действия будут происходить только с переменной-аргументом

  3. Чому getCount() можна викликати ще до створення будь-якого рахунку?
  Потому что это статический метод и ему не нужен экземпляр класса

  4. (Рівень 2) Що станеться, якщо в transfer прибрати перевірку if(this == &to)? Чи зміниться totalMoney після переказу? Чому?
  Если убрать проверку, то в аргумент Account& to может быть передана ссылка на самого себя и сумма будет вычитаться и прибавляться в balance одного и того же объекта 
  totalMoney не изменится, потому что с поля this->balance вычитается та же сумма, которая прибавляется в поле to.balance

  5. (Рівень 2) Чому deposit повертає Account&, а не Account?
  Без амперсанда вместо ссылки будет возвращаться копия объекта
  Возвращаемая ссылка нам нужна, чтобы из одного метода класса можно было вызвать ещё один метод класса

*/
